#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

module.eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks.data.aws_partition.current: Reading...
module.vpc.data.aws_availability_zones.azs: Reading...
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks.data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Reading...
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0ea374fc7d7162ff6]
module.eks.module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_partition.current: Reading...
module.eks.module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.ec2["6-cd-pipeline"].data.aws_ami.image: Reading...
aws_key_pair.ssh-key: Refreshing state... [id=devsecops-cicd-server-key]
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_partition.current: Read complete after 0s [id=aws]
module.ec2["6-cd-pipeline"].data.aws_availability_zones.available: Reading...
module.eks.module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_caller_identity.current: Reading...
module.iam_role.aws_iam_role.app-server-role: Refreshing state... [id=app-server-role-tf]
module.eks.module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=326347646211]
data.aws_caller_identity.current: Read complete after 0s [id=326347646211]
module.eks.module.eks.data.aws_caller_identity.current: Read complete after 0s [id=326347646211]
module.eks.module.eks.data.aws_iam_session_context.current: Reading...
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_caller_identity.current: Read complete after 0s [id=326347646211]
module.eks.module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::326347646211:assumed-role/devsecops-bootcamp-openid-gh-action/terraform-cidi-session]
module.vpc.data.aws_availability_zones.azs: Read complete after 0s [id=us-east-2]
module.ec2["6-cd-pipeline"].data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
module.iam_role.aws_iam_instance_profile.app-server-role: Refreshing state... [id=app-server-role-tf]
module.ec2["6-cd-pipeline"].data.aws_ami.image: Read complete after 0s [id=ami-0862be96e41dcbf74]
module.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0db3dc716faeb303e]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-00e7ebb382204c455]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0794bd7792f3c0708]
module.vpc.data.aws_subnets.private_subnets: Reading...
module.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-08050991118357a15]
module.vpc.data.aws_subnets.public_subnets: Reading...
module.vpc.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0d610913be0db4b1c]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f30f5582062aa85e]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0940c06aca258b850]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0ac56e6ac58407d7a]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c5089e8b98ab8d90]
module.vpc.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0f5122818d026cb5b]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0b69f9a29845a69e1]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-031b485e087cfe4a7]
aws_default_security_group.default-sg: Refreshing state... [id=sg-0db3dc716faeb303e]
module.vpc.data.aws_subnets.public_subnets: Read complete after 1s [id=us-east-2]
module.vpc.data.aws_subnets.private_subnets: Read complete after 1s [id=us-east-2]
module.vpc.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-08ca8acd84971008e]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-062afb95d88b899f1]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0e8a851a81ebe25ff]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0794bd7792f3c07081080289494]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-038f561cf7532041d]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0148c0e9f4b0c9a34]
module.vpc.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0bc87719266f74259]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-049b8bda20099e089]
module.ec2["6-cd-pipeline"].aws_instance.app: Refreshing state... [id=i-0d2383e84672db8a3]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-057d164eca1ce2b04]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-031b485e087cfe4a71080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # aws_default_security_group.default-sg will be updated in-place
  ~ resource "aws_default_security_group" "default-sg" {
        id                     = "sg-0db3dc716faeb303e"
        name                   = "default"
      ~ tags                   = {
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
        }
      ~ tags_all               = {
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.eks.data.aws_eks_cluster.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "this" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "devsecops-cicd-cluster"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.eks.data.aws_eks_cluster_auth.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster_auth" "this" {
      + id    = (known after apply)
      + name  = "devsecops-cicd-cluster"
      + token = (sensitive value)
    }

  # module.eks.aws_iam_role.external-admin will be created
  + resource "aws_iam_role" "external-admin" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::326347646211:user/devsecops-k8s-admin"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "external-admin"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment"      = "dev"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "external-admin-policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "eks:DescribeCluster",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.eks.aws_iam_role.external-developer will be created
  + resource "aws_iam_role" "external-developer" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::326347646211:user/devsecops-k8s-developer"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "external-developer"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment"      = "dev"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "external-developer-policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "eks:DescribeCluster",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.eks.kubernetes_cluster_role.cluster_viewer will be created
  + resource "kubernetes_cluster_role" "cluster_viewer" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "cluster-viewer"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "",
            ]
          + resources  = [
              + "*",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
              + "describe",
            ]
        }
    }

  # module.eks.kubernetes_cluster_role_binding.cluster_viewer will be created
  + resource "kubernetes_cluster_role_binding" "cluster_viewer" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "cluster-viewer"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "cluster-viewer"
        }

      + subject {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "User"
          + name      = "admin"
          + namespace = "default"
        }
    }

  # module.eks.kubernetes_namespace.online-boutique will be created
  + resource "kubernetes_namespace" "online-boutique" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "online-boutique"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.kubernetes_role.namespace-viewer will be created
  + resource "kubernetes_role" "namespace-viewer" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "namespace-viewer"
          + namespace        = "online-boutique"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "",
            ]
          + resources  = [
              + "configmap",
              + "persistentvolumes",
              + "pods",
              + "secrets",
              + "services",
            ]
          + verbs      = [
              + "describe",
              + "get",
              + "list",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + "apps",
            ]
          + resources  = [
              + "daemonsets",
              + "deployments",
              + "statefulsets",
            ]
          + verbs      = [
              + "describe",
              + "get",
              + "list",
              + "watch",
            ]
        }
    }

  # module.eks.kubernetes_role_binding.namespace-viewer will be created
  + resource "kubernetes_role_binding" "namespace-viewer" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "namespace-viewer"
          + namespace        = "online-boutique"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Role"
          + name      = "namespace-viewer"
        }

      + subject {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "User"
          + name      = "developer"
          + namespace = "default"
        }
    }

  # module.eks.module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.30"
      + version            = (known after apply)
    }

  # module.eks.module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.30"
      + version            = (known after apply)
    }

  # module.eks.module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.30"
      + version            = (known after apply)
    }

  # module.eks.module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.module.eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/eks/devsecops-cicd-cluster/cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Name" = "/aws/eks/devsecops-cicd-cluster/cluster"
        }
      + tags_all          = {
          + "Environment"      = "dev"
          + "Name"             = "/aws/eks/devsecops-cicd-cluster/cluster"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }
    }

  # module.eks.module.eks.aws_eks_access_entry.this["cluster_creator"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "devsecops-cicd-cluster"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::326347646211:role/devsecops-bootcamp-openid-gh-action"
      + tags_all          = {
          + "Environment"      = "dev"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = "devsecops-cicd-cluster"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::326347646211:role/devsecops-bootcamp-openid-gh-action"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks.module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "coredns"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "devsecops-cicd-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = {
          + "Environment"      = "dev"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }

      + timeouts {}
    }

  # module.eks.module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "kube-proxy"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "devsecops-cicd-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = {
          + "Environment"      = "dev"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }

      + timeouts {}
    }

  # module.eks.module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "devsecops-cicd-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = {
          + "Environment"      = "dev"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }

      + timeouts {}
    }

  # module.eks.module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "devsecops-cicd-cluster"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "terraform-aws-modules" = "eks"
        }
      + tags_all                  = {
          + "Environment"           = "dev"
          + "Owner"                 = "Terraform"
          + "ProvisionFromDir"      = "live/dev"
          + "Repository"            = "https://github.com/tonyrud/terraform-learn.git"
          + "terraform-aws-modules" = "eks"
        }
      + version                   = "1.30"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = false
        }

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + subnet_ids                = [
              + "subnet-0c5089e8b98ab8d90",
              + "subnet-0f30f5582062aa85e",
              + "subnet-0f5122818d026cb5b",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name" = "devsecops-cicd-cluster-eks-irsa"
        }
      + tags_all        = {
          + "Environment"      = "dev"
          + "Name"             = "devsecops-cicd-cluster-eks-irsa"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.module.eks.aws_iam_policy.cluster_encryption[0] will be created
  + resource "aws_iam_policy" "cluster_encryption" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Cluster encryption policy to allow cluster role to utilize CMK provided"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "devsecops-cicd-cluster-cluster-ClusterEncryption"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment"      = "dev"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }
    }

  # module.eks.module.eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "devsecops-cicd-cluster-cluster-"
      + path                  = "/"
      + tags_all              = {
          + "Environment"      = "dev"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "devsecops-cicd-cluster-cluster"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "logs:CreateLogGroup",
                            ]
                          + Effect   = "Deny"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.eks.module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.eks.module.eks.time_sleep.this[0] will be created
  + resource "time_sleep" "this" {
      + create_duration = "30s"
      + id              = (known after apply)
      + triggers        = {
          + "cluster_certificate_authority_data" = (known after apply)
          + "cluster_endpoint"                   = (known after apply)
          + "cluster_name"                       = "devsecops-cicd-cluster"
          + "cluster_service_cidr"               = (known after apply)
          + "cluster_version"                    = "1.30"
        }
    }

  # module.eks.module.eks_aws_auth.kubernetes_config_map_v1_data.aws_auth[0] will be created
  + resource "kubernetes_config_map_v1_data" "aws_auth" {
      + data          = (known after apply)
      + field_manager = "Terraform"
      + force         = true
      + id            = (known after apply)

      + metadata {
          + name      = "aws-auth"
          + namespace = "kube-system"
        }
    }

  # module.vpc.module.vpc.aws_default_security_group.this[0] will be updated in-place
  ~ resource "aws_default_security_group" "this" {
        id                     = "sg-0db3dc716faeb303e"
        name                   = "default"
      ~ tags                   = {
          + "Name"                                   = "devsecops-cicd-default"
            "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "terraform"                              = "true"
        }
      ~ tags_all               = {
          + "Name"                                   = "devsecops-cicd-default"
          + "terraform"                              = "true"
            # (5 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.eks.module.eks.module.eks_managed_node_group["initial"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "devsecops-cicd-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t2.micro",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "initial-"
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0c5089e8b98ab8d90",
          + "subnet-0f30f5582062aa85e",
          + "subnet-0f5122818d026cb5b",
        ]
      + tags                   = {
          + "Name" = "initial"
        }
      + tags_all               = {
          + "Environment"      = "dev"
          + "Name"             = "initial"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }
      + version                = "1.30"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 2
          + min_size     = 2
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.eks.module.eks.module.eks_managed_node_group["initial"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "initial-eks-node-group-"
      + path                  = "/"
      + tags_all              = {
          + "Environment"      = "dev"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.module.eks.module.eks_managed_node_group["initial"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks.module.eks_managed_node_group["initial"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks.module.eks_managed_node_group["initial"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.eks.module.eks_managed_node_group["initial"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for initial EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "initial-"
      + tags_all               = {
          + "Environment"      = "dev"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }
      + update_default_version = true

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "initial"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name" = "initial"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name" = "initial"
            }
        }
    }

  # module.eks.module.eks.module.kms.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + override_policy_documents = []
      + source_policy_documents   = []

      + statement {
          + actions   = [
              + "kms:*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "Default"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::326347646211:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:CancelKeyDeletion",
              + "kms:Create*",
              + "kms:Delete*",
              + "kms:Describe*",
              + "kms:Disable*",
              + "kms:Enable*",
              + "kms:Get*",
              + "kms:ImportKeyMaterial",
              + "kms:List*",
              + "kms:Put*",
              + "kms:ReplicateKey",
              + "kms:Revoke*",
              + "kms:ScheduleKeyDeletion",
              + "kms:TagResource",
              + "kms:UntagResource",
              + "kms:Update*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyAdministration"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::326347646211:role/devsecops-bootcamp-openid-gh-action",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyUsage"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.eks.module.eks.module.kms.aws_kms_alias.this["cluster"] will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/eks/devsecops-cicd-cluster"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.eks.module.eks.module.kms.aws_kms_key.this[0] will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "devsecops-cicd-cluster cluster encryption key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = false
      + policy                             = (known after apply)
      + tags                               = {
          + "terraform-aws-modules" = "eks"
        }
      + tags_all                           = {
          + "Environment"           = "dev"
          + "Owner"                 = "Terraform"
          + "ProvisionFromDir"      = "live/dev"
          + "Repository"            = "https://github.com/tonyrud/terraform-learn.git"
          + "terraform-aws-modules" = "eks"
        }
    }

  # module.eks.module.eks.module.eks_managed_node_group["initial"].module.user_data.null_resource.validate_cluster_service_cidr will be created
  + resource "null_resource" "validate_cluster_service_cidr" {
      + id = (known after apply)
    }

Plan: 31 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + k8s_cluster = {
      + cluster_endpoint  = (known after apply)
      + cluster_name      = "devsecops-cicd-cluster"
      + configure_kubectl = "aws eks update-kubeconfig --name devsecops-cicd-cluster"
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @tonyrud, Action: `pull_request`*